tutorials/uniformFlow_2Turbines/constant/airfoils/airfoil_12
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_12
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
        (-180.00   0.0602    0.000)
        (-175.00   0.0699    0.218)
        (-170.00   0.1107    0.397)
        (-160.00   0.3045    0.642)
        (-155.00   0.4179    0.715)
        (-150.00   0.5355    0.757)
        (-145.00   0.6535    0.772)
        (-140.00   0.7685    0.762)
        (-135.00   0.8777    0.731)
        (-130.00   0.9788    0.680)
        (-125.00   1.0700    0.613)
        (-120.00   1.1499    0.532)
        (-115.00   1.2174    0.439)
        (-110.00   1.2716    0.337)
        (-105.00   1.3118    0.228)
        (-100.00   1.3378    0.114)
        ( -95.00   1.3492   -0.002)
        ( -90.00   1.3460   -0.120)
        ( -85.00   1.3283   -0.236)
        ( -80.00   1.2964   -0.349)
        ( -75.00   1.2507   -0.456)
        ( -70.00   1.1918   -0.557)
        ( -65.00   1.1204   -0.647)
        ( -60.00   1.0376   -0.727)
        ( -55.00   0.9446   -0.792)
        ( -50.00   0.8429   -0.842)
        ( -45.00   0.7345   -0.874)
        ( -40.00   0.6215   -0.886)
        ( -35.00   0.5067   -0.875)
        ( -30.00   0.3932   -0.839)
        ( -25.00   0.2849   -0.777)
        ( -24.00   0.2642   -0.761)
        ( -23.00   0.2440   -0.744)
        ( -22.00   0.2242   -0.725)
        ( -21.00   0.2049   -0.706)
        ( -20.00   0.1861   -0.685)
        ( -19.00   0.1687   -0.662)
        ( -18.00   0.1533   -0.635)
        ( -17.00   0.1398   -0.605)
        ( -16.00   0.1281   -0.571)
        ( -15.00   0.1183   -0.534)
        ( -14.00   0.1101   -0.494)
        ( -13.00   0.1036   -0.452)
        ( -12.00   0.0986   -0.407)
        ( -11.00   0.0951   -0.360)
        ( -10.00   0.0931   -0.311)
        (  -8.00   0.0930   -0.208)
        (  -6.00   0.0689   -0.111)
        (  -5.50   0.0614   -0.090)
        (  -5.00   0.0547   -0.072)
        (  -4.50   0.0480   -0.065)
        (  -4.00   0.0411   -0.054)
        (  -3.50   0.0349   -0.017)
        (  -3.00   0.0299    0.003)
        (  -2.50   0.0255    0.014)
        (  -2.00   0.0198    0.009)
        (  -1.50   0.0164    0.004)
        (  -1.00   0.0147    0.036)
        (  -0.50   0.0137    0.073)
        (   0.00   0.0113    0.137)
        (   0.50   0.0114    0.213)
        (   1.00   0.0118    0.292)
        (   1.50   0.0122    0.369)
        (   2.00   0.0124    0.444)
        (   2.50   0.0124    0.514)
        (   3.00   0.0123    0.580)
        (   3.50   0.0120    0.645)
        (   4.00   0.0119    0.710)
        (   4.50   0.0122    0.776)
        (   5.00   0.0125    0.841)
        (   5.50   0.0129    0.904)
        (   6.00   0.0135    0.967)
        (   6.50   0.0144    1.027)
        (   7.00   0.0158    1.084)
        (   7.50   0.0174    1.140)
        (   8.00   0.0198    1.193)
        (   8.50   0.0231    1.242)
        (   9.00   0.0275    1.287)
        (   9.50   0.0323    1.333)
        (  10.00   0.0393    1.368)
        (  10.50   0.0475    1.400)
        (  11.00   0.0580    1.425)
        (  11.50   0.0691    1.449)
        (  12.00   0.0816    1.473)
        (  12.50   0.0973    1.494)
        (  13.00   0.1129    1.513)
        (  13.50   0.1288    1.538)
        (  14.50   0.1650    1.587)
        (  15.00   0.1845    1.614)
        (  15.50   0.2052    1.631)
        (  16.00   0.2250    1.649)
        (  16.50   0.2467    1.666)
        (  17.00   0.2684    1.681)
        (  17.50   0.2900    1.699)
        (  18.00   0.3121    1.719)
        (  19.00   0.3554    1.751)
        (  19.50   0.3783    1.767)
        (  20.50   0.4212    1.798)
        (  21.00   0.4415    1.810)
        (  22.00   0.4830    1.830)
        (  23.00   0.5257    1.847)
        (  24.00   0.5694    1.861)
        (  25.00   0.6141    1.872)
        (  26.00   0.6593    1.881)
        (  28.00   0.7513    1.894)
        (  30.00   0.8441    1.904)
        (  32.00   0.9364    1.915)
        (  35.00   1.0722    1.929)
        (  40.00   1.2873    1.903)
        (  45.00   1.4796    1.820)
        (  50.00   1.6401    1.690)
        (  55.00   1.7609    1.522)
        (  60.00   1.8360    1.323)
        (  65.00   1.8614    1.106)
        (  70.00   1.8347    0.880)
        (  75.00   1.7567    0.658)
        (  80.00   1.6334    0.449)
        (  85.00   1.4847    0.267)
        (  90.00   1.3879    0.124)
        (  95.00   1.3912    0.002)
        ( 100.00   1.3795   -0.118)
        ( 105.00   1.3528   -0.235)
        ( 110.00   1.3114   -0.348)
        ( 115.00   1.2557   -0.453)
        ( 120.00   1.1864   -0.549)
        ( 125.00   1.1041   -0.633)
        ( 130.00   1.0102   -0.702)
        ( 135.00   0.9060   -0.754)
        ( 140.00   0.7935   -0.787)
        ( 145.00   0.6750   -0.797)
        ( 150.00   0.5532   -0.782)
        ( 155.00   0.4318   -0.739)
        ( 160.00   0.3147   -0.664)
        ( 170.00   0.1144   -0.410)
        ( 175.00   0.0702   -0.226)
        ( 180.00   0.0602    0.000)
    );
}
