tutorials/uniformFlow_2Turbines/constant/airfoils/airfoil_6
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoil_6
{
    type lookup;
    data
    (
    //   alpha   C_d    C_l
        (-180.00    0.5000   0.000)
        (   0.00    0.5000   0.000)
        ( 180.00    0.5000   0.000)
    );
}
