tutorials/uniformFlow_2Turbines/constant/blade_NREL5MW.txt
blade
{
    data
    (
		//name		//radius[m], blade angle[deg], chord[m]
		(airfoil_0	(0	13.308	3.542   ))//only pure cylinder
		(airfoil_3	(2.8667	13.308	3.542	))//only pure cylinder
		(airfoil_6	(5.6	13.308	3.854	))//only pure cylinder
		(airfoil_8	(8.3333	13.308	4.167	))//only pure cylinder
		(airfoil_12	(11.75	13.308	4.557	))
		(airfoil_16	(15.85	11.48	4.652	))
		(airfoil_20	(19.95	10.162	4.458	))
		(airfoil_24	(24.05	9.011	4.249	))
		(airfoil_28	(28.15	7.795	4.007	))
		(airfoil_32	(32.25	6.544	3.748	))
		(airfoil_36	(36.35	5.361	3.502	))
		(airfoil_40	(40.45	4.188	3.256	))
		(airfoil_45	(44.55	3.125	3.01	))
		(airfoil_49	(48.65	2.319	2.764	))
		(airfoil_53	(52.75	1.526	2.518	))
		(airfoil_56	(56.166	0.863	2.313	))
		(airfoil_59	(58.9	0.37	2.086	))
		(airfoil_62	(61.633	0.106	1.419	))
		(airfoil_63	(63.00	0.000	0.878   ))
    );

}

profiles
{
	#include        "./constant/airfoils/airfoil_0"
	#include        "./constant/airfoils/airfoil_3"
	#include        "./constant/airfoils/airfoil_6"
	#include        "./constant/airfoils/airfoil_8"
	#include        "./constant/airfoils/airfoil_12"
	#include        "./constant/airfoils/airfoil_16"
	#include        "./constant/airfoils/airfoil_20"
	#include        "./constant/airfoils/airfoil_24"
	#include        "./constant/airfoils/airfoil_28"
	#include        "./constant/airfoils/airfoil_32"
	#include        "./constant/airfoils/airfoil_36"
	#include        "./constant/airfoils/airfoil_40"
	#include        "./constant/airfoils/airfoil_45"
	#include        "./constant/airfoils/airfoil_49"
	#include        "./constant/airfoils/airfoil_53"
	#include        "./constant/airfoils/airfoil_56"
	#include        "./constant/airfoils/airfoil_59"
	#include        "./constant/airfoils/airfoil_62"
	#include        "./constant/airfoils/airfoil_63"

}


    GBRatio                    97.0;
    GenTorqueController        true;
    GenTorqueRateLimiter       true;
    RatedRotSpeed              12.1;
    CutInGenSpeed              670.0;
    CutInGenTorque             0.0;
    Region2StartGenSpeed       871.0;
    Region2EndGenSpeed         1161.963;
    KGen                       2.55764E-2;
    RatedGenTorque             43.09355E3;
    RateLimitGenTorque         15.0E3;
    RotSpeedLimiter            true;
    BladeIner                  11.776047E6;
    HubIner                    115.926E3;
    GenIner                    534.116;
    rotorTorque                0;
    rotorSpeed                 0.5;


