tutorials/uniformFlow_2Turbines/constant/forcesRadialDistribution.txt
forcesRadialDistribution
(
//(Uref[m/s], Uinf[m/s], r[m], Udi(r)[m/s], fn(r)[(N/m^2)/(kg/m^3)], ft(r)[(N/m^2)/(kg/m^3)])
(6 6 0.0 6.06834 0.0 0.0)
(6 6 5.13742 5.85456 0.18768 0.2626)
(6 6 9.12794 5.55004 1.76768 1.39204)
(6 6 13.1185 5.2697 6.1994 3.39694)
(6 6 17.109 4.9514 11.7279 4.9274)
(6 6 21.0995 4.67626 14.42216 4.91337)
(6 6 25.09 4.51042 14.80482 4.24154)
(6 6 29.0806 4.42592 14.813 3.66152)
(6 6 33.0711 4.39195 14.80727 3.21846)
(6 6 37.0616 4.38204 14.79279 2.86911)
(6 6 41.0521 4.37449 14.75703 2.58395)
(6 6 45.0426 4.40412 14.66337 2.34008)
(6 6 49.0332 4.46219 14.4202 2.11399)
(6 6 53.0237 4.60577 13.76815 1.86649)
(6 6 57.0142 4.85637 12.08664 1.52386)
(6 6 61.0047 5.19525 7.80843 0.92007)
(6 7 0.0 7.01867 0.0 0.0)
(6 7 5.13742 6.84364 0.19275 0.26746)
(6 7 9.12794 6.59495 1.81543 1.4178)
(6 7 13.1185 6.36547 6.36665 3.45968)
(6 7 17.109 6.10455 12.04325 5.01796)
(6 7 21.0995 5.88048 14.80764 5.00289)
(6 7 25.09 5.74898 15.1961 4.31757)
(6 7 29.0806 5.68602 15.1958 3.72502)
(6 7 33.0711 5.66473 15.1728 3.27059)
(6 7 37.0616 5.66398 15.12469 2.90918)
(6 7 41.0521 5.66802 15.02596 2.60924)
(6 7 45.0426 5.70495 14.81745 2.34508)
(6 7 49.0332 5.76884 14.38218 2.09095)
(6 7 53.0237 5.90046 13.46175 1.80984)
(6 7 57.0142 6.11515 11.54057 1.44295)
(6 7 61.0047 6.38939 7.31241 0.85449)
(6 8 0.0 7.97963 0.0 0.0)
(6 8 5.13742 7.83429 0.19744 0.27205)
(6 8 9.12794 7.62882 1.8596 1.4421)
(6 8 13.1185 7.43836 6.52116 3.51876)
(6 8 17.109 7.22132 12.33322 5.10271)
(6 8 21.0995 7.03554 15.15882 5.08558)
(6 8 25.09 6.92802 15.54694 4.38623)
(6 8 29.0806 6.87927 15.53003 3.78022)
(6 8 33.0711 6.86566 15.47843 3.31304)
(6 8 37.0616 6.871 15.38266 2.93802)
(6 8 41.0521 6.8832 15.2077 2.62226)
(6 8 45.0426 6.92419 14.88334 2.33897)
(6 8 49.0332 6.98974 14.2878 2.06264)
(6 8 53.0237 7.1092 13.18521 1.76021)
(6 8 57.0142 7.29353 11.13434 1.38239)
(6 8 61.0047 7.51837 6.9683 0.80856)
(6 9 0.0 8.94585 0.0 0.0)
(6 9 5.13742 8.82436 0.20184 0.27641)
(6 9 9.12794 8.65354 1.90105 1.46523)
(6 9 13.1185 8.49422 6.66596 3.57491)
(6 9 17.109 8.31218 12.60351 5.18267)
(6 9 21.0995 8.15676 15.48237 5.16239)
(6 9 25.09 8.06777 15.86404 4.44835)
(6 9 29.0806 8.02967 15.82348 3.82812)
(6 9 33.0711 8.0216 15.73525 3.34743)
(6 9 37.0616 8.03131 15.58479 2.95844)
(6 9 41.0521 8.04913 15.33146 2.62745)
(6 9 45.0426 8.09193 14.90165 2.32754)
(6 9 49.0332 8.15671 14.17714 2.03416)
(6 9 53.0237 8.26464 12.94549 1.71765)
(6 9 57.0142 8.42355 10.81599 1.33465)
(6 9 61.0047 8.60987 6.7086 0.77367)
(6 10 0.0 9.91508 0.0 0.0)
(6 10 5.13742 9.8136 0.20599 0.28057)
(6 10 9.12794 9.67126 1.94013 1.48727)
(6 10 13.1185 9.53759 6.80231 3.62833)
(6 10 17.109 9.38462 12.85667 5.25821)
(6 10 21.0995 9.25453 15.78185 5.23382)
(6 10 25.09 9.18088 16.1519 4.5046)
(6 10 29.0806 9.15131 16.08242 3.86974)
(6 10 33.0711 9.14753 15.9527 3.37535)
(6 10 37.0616 9.16038 15.74516 2.97273)
(6 10 41.0521 9.18192 15.41652 2.62775)
(6 10 45.0426 9.22498 14.89379 2.31374)
(6 10 49.0332 9.2875 14.06515 2.00718)
(6 10 53.0237 9.38474 12.73803 1.68099)
(6 10 57.0142 9.52215 10.55697 1.29565)
(6 10 61.0047 9.67768 6.50235 0.74583)
(7 6 0.0 6.15203 0.0 0.0)
(7 6 5.13742 5.85112 0.24891 0.35129)
(7 6 9.12794 5.42317 2.34433 1.8622)
(7 6 13.1185 5.02965 8.22182 4.54427)
(7 6 17.109 4.58434 15.5542 6.59179)
(7 6 21.0995 4.19603 19.12809 6.57322)
(7 6 25.09 3.95076 19.63678 5.67477)
(7 6 29.0806 3.81556 19.65046 4.89947)
(7 6 33.0711 3.7493 19.6498 4.30813)
(7 6 37.0616 3.72171 19.64747 3.84381)
(7 6 41.0521 3.69765 19.63981 3.46882)
(7 6 45.0426 3.72191 19.61113 3.15688)
(7 6 49.0332 3.77841 19.50316 2.88399)
(7 6 53.0237 3.95485 19.05624 2.60583)
(7 6 57.0142 4.2839 17.33294 2.20429)
(7 6 61.0047 4.75907 11.55516 1.37338)
(7 7 0.0 7.07974 0.0 0.0)
(7 7 5.13742 6.83033 0.25546 0.35743)
(7 7 9.12794 6.47505 2.40601 1.89473)
(7 7 13.1185 6.14799 8.43806 4.62361)
...
);
