tutorials/uniformFlow_2Turbines/constant/wtCurvesTable.txt
wtCurvesTable
(
    //(Uref[m/s] Ud[m/s] Cp Ct omega[rad/s] pitch[deg])
    (6     4.76789  0.5046571955306903 0.7051802908250037 0.666666  0.0)
    (7     5.56254  0.5046568656313841 0.7051794743234043 0.777777  0.0)
    (8     6.35719  0.5046577006890030 0.7051805181464715 0.888888  0.0)
    (9     7.15184  0.5046577001883905 0.7051806949520578 1.000000  0.0)
    (10    7.94649  0.5046575188320104 0.7051804363107431 1.111110  0.0)
);